<template>
  <div>
    <bi-button @click="visible = true">打开弹窗</bi-button> {{ visible }}
    <bi-news-dialog
      :visible.sync="visible"
      :dialogInfo="dialogInfo"
      @change="articleChange"
      @collection="toggleCollection"
    >
    </bi-news-dialog>
  </div>
</template>
<script>
export default {
  data() {
    return {
      visible: false,
      dialogInfo: {
        newsTitle: "国际原油大幅下挫 聚丙烯行情接连下滑国际原油大幅下挫",
        isCollection: false,
        keywords: "关键字：国际原油大幅下挫 聚丙烯行情接连下滑",
        source: "百川盈孚",
        browseCount: "122",
        addTime: "2022-08-16 11:20:07",
        content:
          "国际原油：本周（6月30日-7月6日）对全球经济衰退继续蔓延和能源需求下降的担忧增强，国际原油大幅下跌。周内前期，欧佩克及其减产同盟国8月份减产目标符合预期，同时美国汽油和馏分油库存增加引发对需求减缓的担忧，加之美国经济数据不佳加剧了经济衰退担忧，不过利比亚供应中断限制了油价跌幅，原油期货震荡下跌。周内后期，部分产油国工人的罢工抗议活动影响持续，投资者对石油供应的紧缺忧虑提振油价，但是对全球经济衰退继续蔓延和能源需求下降的担忧增强，投资者获利回吐，同时美国原油库存增加，挪威石油将全面复产，以及美元走强均施压原油，国际油价宽幅走低。截至7月6日当周，WTI原油价格为98.53美元/桶，较上周下跌10.25%，较上月均价下跌13.66%，较年初价格上涨29.51%；布伦特原油价格为100.69美元/桶，较上周末下跌13.39%，较上月均价下跌14.31%，较年初上涨27.49%。市场综述：本周国内聚丙烯粒料市场价格再度下探，国内主流成交价格波动在8300-8500元/吨，今日主流成交价格在8500-8600元/吨，国内拉丝级平均价格在8373元/吨左右，环比上周同期价格下跌1.06%，周内聚丙烯粒料市场重心受国际油价及期货等多重利好利空因素作用下整体价格再度下滑，周内受宏观经济形势影响国际油价宽幅收跌，成本面支撑大幅下挫，能源端走势对聚丙烯产品的成本逻辑影响较大，需求面表现相对偏弱，聚丙烯主力期货大幅走低对市场心态打击较大，石化部分牌号下调出厂价，贸易商随行调低报价，周内市场成交价格大部分下滑，下游需求表现一般，工厂维持刚需采购，整体成交较为平淡。宏观经济来看，市场对全球经济衰退继续蔓延和能源需求下降的担忧增强，国际原油大幅下跌。加之美国经济数据不佳加剧了经济衰退担忧，不过利比亚供应中断限制了油价跌幅，原油期货震荡下跌。国际油价虽有回调但聚丙烯粒料成本支撑仍在，生产企业盈利情况有所好转，但部分原料来源制聚丙烯倒挂现象仍存，高成本格局已常态化，下游需求格局的转变或将带动聚丙烯市场突围。需求面来看，市场价格走低刺激终端需求的消费量有所提高，达到下游商户的心理价位，低价货源周内成交尚可，但由于场内新进订单不足导致市场库存降库表现一般，长期来看聚丙烯下游传统行业长期承压，消费量缺乏新兴行业有效带动，行业格局的转变仍需下游消费领域多元化发展。供应面来看，近期新增停车装置仍居高位，加之部分国内大型装置意外停车，供应面压力有所缓解。但三季度预计仍有新增产能陆续投入，长期来看市场供应压力仍大，国际油价继续下跌，原油波动较大带动市场情绪转变。下半年预计新增产能490万吨/年，市场供需矛盾较为突出并长期对市场价格形成打压，新增产能的投放进度预计有推迟，但未来市场供需压力仍不容小觑。今日两油库存72万吨，较上周累库2.5万吨，周内期货盘面低位震荡对市场心态支撑不足，场内新进订单不及预期导致市场库存降库表现不佳。整体来看本周聚丙烯粒料市场价格小幅下行，在成本面、期货以及库存等综合因素影响下市场重心连续下移国际情况：截止7月6日收盘：PP均聚CFR远东在1035美元/吨较上周同期收盘价格下跌1.90%；PP均聚FOB中东在1034美元/吨较上周同期收盘价格下跌1.90%；PP纤维注射级FD西北欧在1695欧元/吨，较上周同期收盘价格下跌6.09%；PP纤维注射级FAS休斯顿1930元/吨，环比上周同期价格下跌2.03%。国际市场大部分价格走弱，海外市场的需求逐渐转弱，加之国外装置陆续重启，导致外盘价格回落，内外盘价差缩窄明显，综合来看外盘价格仍然是高于国内市场价格，国际市场PP价格在市场综合影响下震荡出现分化供应方面：除大港石化、大连有机等部分长期停车装置，其他停车厂家多为装置故障和政策性临时调整为主，包括海国龙油、抚顺石化、浙江石化、庆阳石化、大庆石化、洛阳石化本周常规停车检修；神华宁煤、上海石化、茂名石化故障检修；大庆石化、福建联合近期装置计划重启整体来看，国内大型装置意外停车导致周内装置检修带来的生产端损失量小幅增加，预计2022年市场仍有新增产能的陆续投放，从中长期来看供应压力将稳步上涨",
        newsIdUp: "12",
        newsTitleUp: "",
        newsIdDown: "33",
        newsTitleDown:
          "【中钇富铕矿】2022年7月部分中钇富铕矿产量数据发布月部分中钇富铕矿产量数据发布月部分中钇富铕矿产量数据发布月部分中钇富铕矿产量数据发布月部分中钇富铕矿产量数据发布",
      },
    };
  },
  methods: {
    articleChange(type, info) {
      console.log("type", type, info);
    },
    toggleCollection(value, info) {
      console.log("toggleCollection", value, info);
    },
  },
};
</script>
